In [1]:
import pandas as pd

In [3]:
df_employees = pd.read_csv('../user_access_logs_new/employees.csv')
df_employees.head()

,employee_number,first_name,last_name,email,title
0,EMP003037,Juliana,Burbudge,juliana.burbudge@consultants.com,Director of Sales
1,EMP003045,Lizzie,Blue,lizzie.blue@consultants.com,Sales Assistant
2,EMP003051,Marjory,Selcraig,marjory.selcraig@consultants.com,Sales Assistant
3,EMP003068,Aguste,O'Connor,aguste.o'connor@consultants.com,Sales Assistant
4,EMP003097,Clemens,Kopman,clemens.kopman@consultants.com,Account Manager

In [4]:
df_system_access = pd.read_csv('../user_access_logs_new/system_access.csv')
df_system_access.head()

      id    access_level
0  17263   Account Admin
1  10275  Contract Entry
2   7568  Contract Entry
3  21986   Account Admin
4  20614   Account Admin

In [5]:
df_system_access['id'] = 'EMP' + df_system_access['id'].astype(str).str.zfill(6)
df_system_access

            id        access_level
0    EMP017263       Account Admin
1    EMP010275      Contract Entry
2    EMP007568      Contract Entry
3    EMP021986       Account Admin
4    EMP020614       Account Admin
..         ...                 ...
849  EMP007600      Contract Entry
850  EMP011112  Approval - Manager
851  EMP005295      Contract Entry
852  EMP007470       Account Admin
853  EMP016383      Contract Entry

[854 rows x 2 columns]